#Область ПрограммныйИнтерфейс

Процедура ВКМ_ОтправитьСообщенияВТелеграмм() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Уведомления.Ссылка КАК Ссылка,
		|	Уведомления.ТекстСообщения КАК ТекстСообщения
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК Уведомления";
	
	РезультатЗапроса = Запрос.Выполнить();	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		РезультатОтправки = ОтправитьСообщение(ВыборкаДетальныеЗаписи.ТекстСообщения);		
		
		Если РезультатОтправки <> Неопределено И РезультатОтправки.КодСостояния = 200 Тогда
			СправочникОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
			СправочникОбъект.Удалить();
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

Функция ОтправитьСообщение(ТекстСообщения) Экспорт
	
	ПараметрыТГ = ПрочитатьПараметрыСоединения();
	
	Соединение   = Новый HTTPСоединение("api.telegram.org", 443, , , , ПараметрыТГ.Таймаут, Новый ЗащищенноеСоединениеOpenSSL());	
	АдресРесурса = СтрШаблон("/bot%1/sendMessage", ПараметрыТГ.Токен);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	ЗапросКСерверу = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	
	СтруктураССообщением = Новый Структура("chat_id, text", ПараметрыТГ.IDГруппы, ТекстСообщения);
	
	JSONСтрока = ЗаписатьЗначениеJSON(СтруктураССообщением);
	ЗапросКСерверу.УстановитьТелоИзСтроки(JSONСтрока);
	
	Ответ = Соединение.ВызватьHTTPМетод("POST", ЗапросКСерверу);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ЗаписьЖурналаРегистрации("Ошибка отправки сообщения в Telegram", УровеньЖурналаРегистрации.Ошибка, , , Ответ.ПолучитьТелоКакСтроку(), );
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПрочитатьПараметрыСоединения()
	
	// Читаем значения констант
	ЗначениеТаймаут = Константы.ВКМ_ТаймаутСоединения.Получить();
	Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	IDГруппы  = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	// Компактная проверка заполнения через тернарное условие
	Таймаут = ?(ЗначениеЗаполнено(ЗначениеТаймаут), ЗначениеТаймаут, 0);
	ПараметрыЗаполнены = ЗначениеЗаполнено(Токен) И ЗначениеЗаполнено(IDГруппы);
		
	// Сборка структуры в одну строчку
	Параметры = Новый Структура("Таймаут, Токен, IDГруппы, ПараметрыЗаполнены", Таймаут, Токен, IDГруппы, ПараметрыЗаполнены);
		
	Возврат Параметры;
	
КонецФункции

#КонецОбласти