
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ПараметрыТелеграмБота(Команда)
	ПараметрыФормы = Новый Структура("", );
	ОткрытьФорму("ОбщаяФорма.ВКМ_ФормаПараметровTGБота", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтправитьНаСервере()
	
	Ответ = ВКМ_Телеграм.ОтправитьСообщение(Текст).ПолучитьТелоКакСтроку();

	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(Ответ);
	СодержимоеОтвета = ПрочитатьJSON(Чтение);
	Чтение.Закрыть();
	   
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(Новый ПараметрыЗаписиJSON(,Символы.Таб));
   	ЗаписатьJSON(Запись, СодержимоеОтвета,);
	ОтветСервера = Запись.Закрыть();
	
КонецПроцедуры

#КонецОбласти
