#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Адрес = "";
	Если Параметры.Свойство("Адрес", Адрес) Тогда
		СтруктураДанных = ПолучитьИзВременногоХранилища(Адрес);
		Год = СтруктураДанных.Год;
		ТЧ.Загрузить(СтруктураДанных.ДанныеТаблицы);
	КонецЕсли;
	
	МаксимальноеЧислоДнейОтпуска = Константы.ВКМ_МаксимальноеЧислоДнейОтпуска.Получить();
	
	ЗаполнитьДиаграммуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДиаграммуНаСервере()
	
	ГрафикОтпусков.Очистить();
	ГрафикОтпусков.Обновление = Ложь;
	ГрафикОтпусков.АвтоОпределениеПолногоИнтервала = Ложь;
	ГрафикОтпусков.УстановитьПолныйИнтервал(НачалоГода(Год), КонецГода(Год));
	
	ЭлементМеток = ГрафикОтпусков.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
	ЭлементМеток.Единица = ТипЕдиницыШкалыВремени.Месяц; 
	ЭлементМеток.ЛинииДелений = Новый Линия(ТипЛинииДиаграммы.Пунктир, 2);
	ЭлементМеток.Формат = "ДФ=MMММ;";
	
	Серия = ГрафикОтпусков.УстановитьСерию("Отпуск");
	Серия.ШтриховкаПерекрывающихсяИнтервалов = Истина;
	Серия.ПриоритетЦвета = Истина;
	
	ВсегоДнейПоСотрудникам = Новый Соответствие;
	Для Каждого СтрокаТЧ Из ТЧ Цикл
		ТекущийИтог = ВсегоДнейПоСотрудникам.Получить(СтрокаТЧ.Sотрудник);
		ТекущийИтог = ?(ТекущийИтог = Неопределено, 0, ТекущийИтог);
		ВсегоДнейПоСотрудникам.Вставить(СтрокаТЧ.Сотрудник, ТекущийИтог + СтрокаТЧ.ДнейОтпуска);
	КонецЦикла;
		
	Для Каждого СтрокаТЧ Из ТЧ Цикл
		
		Точка = ГрафикОтпусков.УстановитьТочку(СтрокаТЧ.Сотрудник);
		
		// Раскрашиваем точку на основании собранных итогов
		ОбщееКоличествоДней = ВсегоДнейПоСотрудникам.Получить(СтрокаТЧ.Сотрудник);
		Если ОбщееКоличествоДней > МаксимальноеЧислоДнейОтпуска Тогда
			Точка.ЦветФона = WebЦвета.СветлоРозовый;
		ИначеЕсли ОбщееКоличествоДней < МаксимальноеЧислоДнейОтпуска Тогда
			Точка.ЦветФона = WebЦвета.ЦианСветлый;
		ИначеЕсли ОбщееКоличествоДней = МаксимальноеЧислоДнейОтпуска Тогда
			Точка.ЦветФона = WebЦвета.Белый;
		КонецЕсли;
		
		Значение = ГрафикОтпусков.ПолучитьЗначение(Точка, Серия);
		
		// Добавляем интервал отпуска на шкалу времени
		Интервал = Значение.Добавить(); 
		Интервал.Начало = СтрокаТЧ.ДатаНачала;
		Интервал.Конец  = СтрокаТЧ.ДатаОкончания; 
		
	КонецЦикла;
	
	ГрафикОтпусков.Обновление = Истина;

КонецПроцедуры

#КонецОбласти